package com.epam.homework;

import java.util.Scanner;
import java.util.regex.Matcher;
import java.util.regex.Pattern;

public class Task8 {

    /**
     * Ввести N слов с консоли.
     * Помимо обычных слов, во входной последовательности могут встречаться целые числа (в том числе большие чем Long.MAX_VALUE).
     * Среди них необходимо найти число-палиндром (одинаково читающееся в обоих направлениях).
     * Число, содержащее одну цифру, также является палиндромом.
     * Если палиндромов во входной последовательности больше одного - найти второй уникальный из них.
     * <p>
     * Формат входных данных:
     * N (целое число, 0 < N < 100) - количество слов в строке
     * Строка, содержащая минимум N слов, разделенных пробелами
     * <p>
     * Формат выходных данных:
     * В результате выполнения в выходной поток должно быть выведено найденное число-палиндром.
     * В случае, если не найдено ни одного палиндрома - в поток должно быть выведено "NOT FOUND".
     * <p>
     * ---------------------------------------------------------------------------------------------------
     * Пример выполнения задания:
     * <p>
     * Входные данные:
     * 15
     * Chapter 11 describes exceptions, chapter 13 describes binary compatibility... chapter 22 presents a syntactic grammar
     * <p>
     * Выходные данные:
     * 22
     */
    public static void main(String[] args) {

        try (Scanner in = new Scanner(System.in)) {

            int wordsCount = Integer.valueOf(in.nextLine());

            String palindrome = "NOT FOUND";
            int numOfUniquePalindrome = 0;

            for (int i = 0; i < wordsCount; i++) {

                String word = in.next();

                if (containsOnlyDigits(word) && isPalindrome(word) && !word.equals(palindrome)) {

                    numOfUniquePalindrome++;

                    if (numOfUniquePalindrome <= 2) {
                        palindrome = word;
                    }
                }
            }

            System.out.println(palindrome);
        }
    }

    private static final Pattern DIGITS = Pattern.compile("[0-9]+");

    private static boolean containsOnlyDigits(String word) {
        Matcher matcher = DIGITS.matcher(word);
        return matcher.matches();
    }

    private static boolean isPalindrome(String word) {

        for (int i = 0; i < word.length() / 2; i++) {
            if (word.charAt(i) != word.charAt(word.length() - 1 - i)) {
                return false;
            }
        }

        return true;
    }
}